Оперативные_задачи_Занятие_4/src/Documents/ВыплатаДенег/ВыплатаДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыплатаДенег</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.Касса</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
  </attributes>
</mdclass:Document>

Оперативные_задачи_Занятие_4/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Оперативные_задачи_Занятие_4/src/Documents/ВыплатаДенег/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(КассаОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Касса.Остатки(&Период, ) КАК КассаОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаиморасчетыОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&Период, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки";
	
	Период = МоментВремени();
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	РезультатЗапроса = МассивРезультатов.Получить(0);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Нехватка = Сумма - ВыборкаДетальныеЗаписи.СуммаОстаток;
		
		Если Нехватка > 0 Тогда
		
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает денег в кассе!! Нехватка " + Нехватка + " у.е.";
			Сообщение.Поле = "Сумма";
			Сообщение.ПутьКДанным = "Объект";
			Сообщение.КлючДанных = Ссылка;
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	РезультатЗапроса = МассивРезультатов.Получить(1);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		
		Если ВыборкаДетальныеЗаписи.СуммаОстаток > 0 Тогда
		
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Это контрагент имеет перед нами долг " + ВыборкаДетальныеЗаписи.СуммаОстаток + " у.е.
			| Выдача денег запрещена";
			Сообщение.Поле = "Контрагент";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Движения.Касса.Записывать = Истина;
    Движение = Движения.Касса.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
    Движение.Период = Дата;
    Движение.Сумма = Сумма;
    

	Движения.Взаиморасчеты.Записывать = Истина;
    Движение = Движения.Взаиморасчеты.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Контрагент = Контрагент;
    Движение.Сумма = Сумма;


КонецПроцедуры



//Процедура ОбработкаПроведения(Отказ, Режим)


//	Движения.Касса.Записывать = Истина;
//    Движение = Движения.Касса.Добавить();
//    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
//    Движение.Период = Дата;
//    Движение.Сумма = Сумма;
//    

//	Движения.Взаиморасчеты.Записывать = Истина;
//    Движение = Движения.Взаиморасчеты.Добавить();
//    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//    Движение.Период = Дата;
//    Движение.Контрагент = Контрагент;
//    Движение.Сумма = Сумма;


//КонецПроцедуры
